base_recipes = {
 #秘術師
    "祕術長杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12
        }
    },
    "奥祕法杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "奧祕寶珠":1
        }
    },
    "夜禱之戒": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "沉眠之戒":1
        }
    },
    "祕術法杖": {
        "材料": {
            "板材": 16,
            "金屬塊": 8
        }
    },
    "謎團法杖": {
        "材料": {
            "T4_板材": 20,
            "T4_金屬塊": 12
        }
    },
    "巫術法杖": {
        "材料": {
            "板材": 16,
            "金屬塊": 8,
            "失落祕術水晶":1
        }
    },
        "惡毒軌跡": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "癲狂觸媒":1
        }
    },
        "星界法杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "星觸水晶":1
        }
    },
#烈焰術士
    "火焰法杖": {
        "材料": {
            "板材": 16,
            "金屬塊": 8
        }
    },
    "火焰長杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
        }
    },
    "煉獄法杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
        }
    },
    "野火法杖": {
        "材料": {
            "板材": 16,
            "金屬塊": 8,
            "野火寶珠": 1
        }
    },
    "炎火石法杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "燃燒寶珠":1,
        }
    },
    "灼燒法杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "不潔之環":1
        }
    },
        "暮歌之戒": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "柔光之戒":1
        }
    },
        "焰行者法杖": {
        "材料": {
            "板材": 16,
            "金屬塊": 8,
            "焚心水晶":1
        }
    },
#祭司
    "神聖法杖": {
        "材料": {
            "板材": 16,
            "布料": 8
        }
    },
    "神聖長杖": {
        "材料": {
            "板材": 20,
            "布料": 12
        }
    },
    "神性法杖": {
        "材料": {
            "板材": 20,
            "布料": 12
        }
    },
    "生命之觸法杖": {
        "材料": {
            "板材": 16,
            "布料": 8,
            "癲狂之環": 1
        }
    },
    "墮落法杖": {
        "材料": {
            "板材": 20,
            "布料": 12,
            "煉獄卷軸":1,
        }
    },
    "贖罪法杖": {
        "材料": {
            "板材": 20,
            "布料": 12,
            "驚魂之環":1
        }
    },
    "墮神法杖": {
        "材料": {
            "板材": 16,
            "布料": 8,
            "救世珍寶":1
        }
    },
    "榮光法杖": {
        "材料": {
            "板材": 20,
            "布料": 12,
            "榮耀水晶":1
        }
    },
#寒冰法師
    "寒冰法杖": {
        "材料": {
            "板材": 16,
            "金屬塊": 8
        }
    },
    "寒冰長杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
        }
    },
    "冰河法杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
        }
    },
    "白霜法杖": {
        "材料": {
            "板材": 16,
            "金屬塊": 8,
            "白霜寶珠": 1
        }
    },
    "冰柱法杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "冰柱寶珠":1,
        }
    },
    "永凍稜鏡": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "詛咒永凍水晶":1
        }
    },
        "冰嘯法杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "冰晶碎片":1
        }
    },
        "極地法杖": {
        "材料": {
            "板材": 16,
            "金屬塊": 8,
            "冰寒水晶":1
        }
    },
#術士
    "詛咒法杖": {
        "材料": {
            "板材": 16,
            "金屬塊": 8
        }
    },
    "詛咒長杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
        }
    },
    "惡魔法杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
        }
    },
    "命咒法杖": {
        "材料": {
            "板材": 16,
            "金屬塊": 8,
            "失落詛咒水晶": 1
        }
    },
    "詛咒頭骨": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "詛咒顎骨":1,
        }
    },
    "天譴法杖": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "血鑄觸媒":1
        }
    },
        "喚影者": {
        "材料": {
            "板材": 16,
            "金屬塊": 8,
            "碎裂混沌寶珠":1
        }
    },
        "腐敗呼喚者": {
        "材料": {
            "板材": 16,
            "金屬塊": 8,
            "腐敗水晶":1
        }
    },
#典籍
    "咒法之書": {
        "材料": {
            "布料": 4,
            "皮革": 4
        }
    },
    "祕密之眼": {
        "材料": {
            "布料": 4,
            "皮革": 4,
            "迷惑水晶":1,
        }
    },
    "怨靈": {
        "材料": {
            "布料": 4,
            "皮革": 4,
            "惡魔顎骨":1
        }
    },
    "祭祀環": {
        "材料": {
            "布料": 4,
            "皮革": 4,
            "烙印石環": 1
        }
    },
    "天界香爐": {
        "材料": {
            "布料": 4,
            "皮革": 4,
            "破損天界信物": 1
        }
    },
#弓箭鬥士
    "弓箭": {
        "材料": {
            "板材": 32,
        }
    },
    "戰弓": {
        "材料": {
            "板材": 32,
        }
    },
    "長弓": {
        "材料": {
            "板材": 32,
        }
    },
    "低語之弓": {
        "材料": {
            "板材": 32,
            "驚魂箭矢": 1
        }
    },
    "哀嘯之弓": {
        "材料": {
            "板材": 32,
            "惡魔箭鏃":1,
        }
    },
    "巴頓之弓": {
        "材料": {
            "板材": 32,
            "雕飾白骨":1
        }
    },
    "穿霧者": {
        "材料": {
            "板材": 32,
            "無暇手工弓身":1
        }
    },
#匕首鬥士
    "匕首": {
        "材料": {
            "金屬塊": 12,
            "皮革": 12
        }
    },
    "雙匕首": {
        "材料": {
            "金屬塊": 16,
            "皮革": 16,
        }
    },
    "鉤爪": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
        }
    },
    "血刃": {
        "材料": {
            "金屬塊": 16,
            "皮革": 8,
            "硬化柔刃": 1
        }
    },
    "惡魔之牙": {
        "材料": {
            "金屬塊": 12,
            "皮革": 12,
            "破碎惡魔之牙":1,
        }
    },
    "賜死者": {
        "材料": {
            "金屬塊": 16,
            "皮革": 16,
            "驚魂碎刃":1
        }
    },
        "憤怒拳刃": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
            "染血古物":1
        }
    },

#長矛鬥士
    "長矛": {
        "材料": {
            "板材": 16,
            "金屬塊": 8
        }
    },
    "長槍": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
        }
    },
    "長刀": {
        "材料": {
            "板材": 12,
            "金屬塊": 20,
        }
    },
    "蒼鷺長矛": {
        "材料": {
            "板材": 16,
            "金屬塊": 8,
            "看守者矛首": 1
        }
    },
    "獵魂者": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "煉獄叉槍首":1,
        }
    },
    "三叉戟": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "詛咒戟刃":1
        }
    },
        "破曉者": {
        "材料": {
            "板材": 16,
            "金屬塊": 8,
            "破損先祖護手":1
        }
    },

#鐵頭棍鬥士
    "鐵頭棍": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20
        }
    },
    "鐵甲棍": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
        }
    },
    "雙刃棍": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
        }
    },
    "黑僧棍": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
            "摩根娜強化槍首": 1
        }
    },
    "靈魂之鐮": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
            "地獄雙鐮刃":1,
        }
    },
    "平衡棍": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
            "防腐原石":1
        }
    },
        "聖杯追尋者": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
            "陳舊手杖":1
        }
    },
#自然法杖鬥士
    "自然法杖": {
        "材料": {
            "板材": 16,
            "布料": 8
        }
    },
    "自然長杖": {
        "材料": {
            "板材": 20,
            "布料": 12,
        }
    },
    "狂野法杖": {
        "材料": {
            "板材": 20,
            "布料": 12,
        }
    },
    "德魯伊法杖": {
        "材料": {
            "板材": 16,
            "布料": 8,
            "德魯伊碑文": 1
        }
    },
    "瘟疫法杖": {
        "材料": {
            "板材": 20,
            "布料": 12,
            "瘟疫象徵":1,
        }
    },
    "災禍法杖": {
        "材料": {
            "板材": 20,
            "布料": 12,
            "防腐原木":1
        }
    },
        "鐵根法杖": {
        "材料": {
            "板材": 16,
            "布料": 8,
            "無根永生幼苗":1
        }
    },
#火炬鬥士
    "火炬": {
        "材料": {
            "板材": 4,
            "布料": 4
        }
    },
    "喚霧者": {
        "材料": {
            "板材": 4,
            "布料": 4,
            "符文號角": 1
        }
    },
    "睨視手杖": {
        "材料": {
            "板材": 4,
            "布料": 4,
            "地獄手柄":1,
        }
    },
    "地窖燭光": {
        "材料": {
            "板材": 4,
            "布料": 4,
            "驚魂蠟燭":1
        }
    },
        "神聖權杖": {
        "材料": {
            "板材": 4,
            "布料": 4,
            "阿瓦隆破碎紀念物":1
        }
    },
#劍鬥士
    "闊劍": {
        "材料": {
            "金屬塊": 16,
            "皮革": 8
        }
    },
    "闊刃大劍": {
        "材料": {
            "金屬塊": 20,
            "皮革": 12,
        }
    },
    "雙劍": {
        "材料": {
            "金屬塊": 20,
            "皮革": 12,
        }
    },
    "王者之劍": {
        "材料": {
            "金屬塊": 16,
            "皮革": 8,
            "血鑄之刃": 1
        }
    },
    "斷水劍": {
        "材料": {
            "金屬塊": 20,
            "皮革": 12,
            "惡魔之刃":1,
        }
    },
    "雙刀": {
        "材料": {
            "金屬塊": 20,
            "皮革": 12,
            "詛咒碎刃":1
        }
    },
        "擁王者": {
        "材料": {
            "金屬塊": 20,
            "皮革": 12,
            "先王遺物":1
        }
    },

#斧頭鬥士
    "戰斧": {
        "材料": {
            "板材": 8,
            "金屬塊": 16
        }
    },
    "大斧": {
        "材料": {
            "板材": 12,
            "金屬塊": 20,
        }
    },
    "斧槍": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
        }
    },
    "喚腐者": {
        "材料": {
            "板材": 16,
            "金屬塊": 12,
            "摩根娜斧槍首": 1
        }
    },
    "煉獄鐮刀": {
        "材料": {
            "板材": 12,
            "金屬塊": 20,
            "地獄鐮刃":1,
        }
    },
    "熊爪": {
        "材料": {
            "板材": 12,
            "金屬塊": 20,
            "看守者斧首":1
        }
    },
        "破界者": {
        "材料": {
            "板材": 12,
            "金屬塊": 20,
            "阿瓦隆戰鬥回憶錄":1
        }
    },
#錘矛鬥士
    "錘矛": {
        "材料": {
            "金屬塊": 16,
            "布料": 8
        }
    },
    "重型錘矛": {
        "材料": {
            "金屬塊": 20,
            "布料": 12,
        }
    },
    "晨星": {
        "材料": {
            "金屬塊": 20,
            "布料": 12,
        }
    },
    "基岩錘矛": {
        "材料": {
            "金屬塊": 16,
            "布料": 8,
            "符文原石": 1
        }
    },
    "夢魘錘矛": {
        "材料": {
            "金屬塊": 16,
            "布料": 12,
            "煉獄錘矛首":1,
        }
    },
    "卡蘭姆錘矛": {
        "材料": {
            "金屬塊": 20,
            "布料": 12,
            "注魔錘矛首":1
        }
    },
        "守誓者": {
        "材料": {
            "金屬塊": 20,
            "布料": 12,
            "破碎誓言":1
        }
    },
#鎚子鬥士
    "鎚子": {
        "材料": {
            "金屬塊": 24
        }
    },
    "長鎚": {
        "材料": {
            "金屬塊": 20,
            "布料": 12,
        }
    },
    "巨鎚": {
        "材料": {
            "金屬塊": 20,
            "布料": 12,
        }
    },
    "墓鎚": {
        "材料": {
            "金屬塊": 20,
            "布料": 12,
            "古代鎚首": 1
        }
    },
    "鍛造鎚": {
        "材料": {
            "金屬塊": 20,
            "布料": 12,
            "地獄鎚首":1,
        }
    },
    "守林者": {
        "材料": {
            "金屬塊": 20,
            "布料": 12,
            "刻紋原木":1
        }
    },
        "正義之手": {
        "材料": {
            "金屬塊": 20,
            "布料": 12,
            "萬金之手":1
        }
    },
#戰爭手套鬥士
    "格鬥家手套": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20
        }
    },
    "戰鬥腕甲": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
        }
    },
    "尖刺護手": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
        }
    },
    "巨熊拳套": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
            "巨熊守衛遺骸": 1
        }
    },
    "地獄火之手": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
            "惡魔斷角":1,
        }
    },
    "鴉擊皮帶手套": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
            "變形暗鴉金屬護甲":1
        }
    },
        "阿瓦隆之拳": {
        "材料": {
            "金屬塊": 12,
            "皮革": 20,
            "阿瓦隆破損護手":1
        }
    },
#十字弓鬥士
    "十字弓": {
        "材料": {
            "板材": 20,
            "金屬塊": 12
        }
    },
    "重型十字弓": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
        }
    },
    "輕型十字弓": {
        "材料": {
            "板材": 16,
            "金屬塊": 8,
        }
    },
    "哀泣複誦者": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "十字弓遺失零件": 1
        }
    },
    "電光施放者": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "地獄弩箭": 1,
        }
    },
    "圍城之弓": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "迷惑弩箭":1
        }
    },
        "塑能者": {
        "材料": {
            "板材": 20,
            "金屬塊": 12,
            "阿瓦隆詠唱旋輪":1
        }
    },
#盾牌鬥士
    "盾牌": {
        "材料": {
            "板材": 4,
            "金屬塊": 4
        }
    },
    "石棺之盾": {
        "材料": {
            "板材": 4,
            "金屬塊": 4,
            "古代盾牌骨架": 1
        }
    },
    "懦弱盾牌": {
        "材料": {
            "板材": 4,
            "金屬塊": 4,
            "煉獄盾牌骨架":1,
        }
    },
    "破面者": {
        "材料": {
            "板材": 4,
            "金屬塊": 4,
            "血鑄尖刺":1
        }
    },
        "星域神盾": {
        "材料": {
            "板材": 4,
            "金屬塊": 4,
            "阿瓦隆碎裂傳世寶":1
        }
    },
#金屬長靴鬥士
    "士兵長靴": {
        "材料": {
            "金屬塊": 8,

        }
    },
    "騎士長靴": {
        "材料": {
            "金屬塊": 8,
           
        }
    },
    "守衛者長靴": {
        "材料": {
            "金屬塊": 8,
          
        }
    },
    "守墓者長靴": {
        "材料": {
            "金屬塊": 8,
            "古代綁帶":1,
           
        }
    },
    "惡魔長靴": {
        "材料": {
            "金屬塊": 8,
            "惡魔內襯": 1,
           
        }
    },
    "審判者長靴": {
        "材料": {
            "金屬塊": 8,
            "烙印綁帶": 1,
            
        }
    },
    "幽影編織者長靴": {
        "材料": {
            "金屬塊": 8,
            "迷霧織蛛尖爪": 1,
            
        }
    },
    "英勇長靴": {
        "材料": {
            "金屬塊": 8,
           
        }
    },
    "守衛者長靴": {
        "材料": {
            "金屬塊": 8,
            "尊榮腿甲": 1,
        }
    },
#金屬護甲鬥士
    "士兵護甲": {
        "材料": {
            "金屬塊": 16,
            
           
        }
    },
    "騎士護甲": {
        "材料": {
            "金屬塊": 16,
            
           
        }
    },
    "守衛者護甲": {
        "材料": {
            "金屬塊": 16,
            
            
        }
    },
        "守墓者護甲": {
        "材料": {
            "金屬塊": 16,
            "古代環鏈": 1,
            
        }
    },"惡魔護甲": {
        "材料": {
            "金屬塊": 16,
            "惡魔金屬護甲": 1
           
        }
    },
    "審判者護甲": {
        "材料": {
            "金屬塊": 16,
            "防腐皮草": 1,

            
        }
    },
    "幽影編織者護甲": {
        "材料": {
            "金屬塊": 16,
            "迷霧織蛛甲殼": 1,
            
        }
    },
    "英勇護甲": {
        "材料": {
            "金屬塊": 16,
            "尊榮金屬護甲": 1,
            
        }
    },
#金屬頭盔鬥士
    "士兵頭盔": {
        "材料": {
            "金屬塊": 8,
            
           
        }
    },
    "騎士頭盔": {
        "材料": {
            "金屬塊": 8,
            
           
        }
    },
    "守衛者頭盔": {
        "材料": {
            "金屬塊": 8,
            
            
        }
    },
    "守墓者頭盔": {
        "材料": {
            "金屬塊": 8,
            "古代襯墊": 1,

        }
    },"惡魔頭盔": {
        "材料": {
            "金屬塊": 8,
            "惡魔殘片": 1,

           
        }
    },
     "審判者": {
        "材料": {
            "金屬塊": 8,
            "刻顱襯墊": 1,

            
        }
    },
    "幽影編織者頭盔": {
        "材料": {
            "金屬塊": 8,
            "迷霧織蛛大顎": 1,
            
        }
    },
    "英勇頭盔": {
        "材料": {
            "金屬塊": 8,
            "尊榮面甲": 1,
            
        }
    },#金屬頭盔鬥士
    "士兵頭盔": {
        "材料": {
            "金屬塊": 8,
            
           
        }
    },
    "騎士頭盔": {
        "材料": {
            "金屬塊": 8,
            
           
        }
    },
    "守衛者頭盔": {
        "材料": {
            "金屬塊": 8,
            
            
        }
    },
    "守墓者頭盔": {
        "材料": {
            "金屬塊": 8,
            "古代襯墊": 1,

        }
    },"惡魔頭盔": {
        "材料": {
            "金屬塊": 8,
            "惡魔殘片": 1,

           
        }
    },
     "審判者": {
        "材料": {
            "金屬塊": 8,
            "刻顱襯墊": 1,

            
        }
    },
    "幽影編織者頭盔": {
        "材料": {
            "金屬塊": 8,
            "迷霧織蛛大顎": 1,
            
        }
    },
    "英勇頭盔": {
        "材料": {
            "金屬塊": 8,
            "尊榮面甲": 1,
            
        }
    },
#皮革鞋子鬥士
    "傭兵鞋子": {
        "材料": {
            "皮革": 8,
            
           
        }
    },
    "獵人鞋子": {
        "材料": {
            "皮革": 8,
            
           
        }
    },
    "刺客鞋子": {
        "材料": {
            "皮革": 8,
            
            
        }
    },
    "潛行者鞋子": {
        "材料": {
            "皮革": 8,
            "注魔鞋底": 1,

        }
    },"惡棍鞋子": {
        "材料": {
            "皮革": 8,
            "潛魔綁帶": 1,

           
        }
    },
     "幽魂鞋子": {
        "材料": {
            "皮革": 8,
            "驚魂綁帶": 1,

            
        }
    },
    "迷霧行者鞋子": {
        "材料": {
            "皮革": 8,
            "獅鷲絨毛": 1,
            
        }
    },
    "堅韌鞋子": {
        "材料": {
            "皮革": 8,
            "先知扣環": 1,
            
        }
    },
#皮革外套鬥士
    "傭兵外套": {
        "材料": {
            "皮革":16,
            
           
        }
    },
    "獵人外套": {
        "材料": {
            "皮革":16,
            
           
        }
    },
    "刺客外套": {
        "材料": {
            "皮革":16,
            
            
        }
    },
    "潛行者外套": {
        "材料": {
            "皮革":16,
            "注魔皮革襯裡": 1,

        }
    },"惡棍外套": {
        "材料": {
            "皮革":16,
            "潛魔皮革": 1,

           
        }
    },
     "幽魂外套": {
        "材料": {
            "皮革":16,
            "驚魂皮革": 1,

            
        }
    },
    "迷霧行者外套": {
        "材料": {
            "皮革":16,
            "無損獅鷲羽毛": 1,
            
        }
    },
    "堅韌外套": {
        "材料": {
            "皮革":16,
            "先知飾帶": 1,
            
        }
    },
#皮革兜帽鬥士
    "傭兵兜帽": {
        "材料": {
            "皮革":8,
            
           
        }
    },
    "獵人兜帽": {
        "材料": {
            "皮革":8,
            
           
        }
    },
    "刺客兜帽": {
        "材料": {
            "皮革":8,
            
            
        }
    },
    "潛行者兜帽": {
        "材料": {
            "皮革":8,
            "注魔面甲": 1,

        }
    },"惡棍兜帽": {
        "材料": {
            "皮革":8,
            "潛魔襯墊": 1,

           
        }
    },
     "幽魂兜帽": {
        "材料": {
            "皮革":8,
            "驚魂面甲": 1,

            
        }
    },
    "迷霧行者兜帽": {
        "材料": {
            "皮革":8,
            "完美獅鷲利喙": 1,
            
        }
    },
    "堅韌兜帽": {
        "材料": {
            "皮革":8,
            "先知襯墊": 1,
            
        }
    },
#布質便鞋鬥士
    "學者便鞋": {
        "材料": {
            "布料":8,
            
           
        }
    },
    "牧師便鞋": {
        "材料": {
            "布料":8,
            
           
        }
    },
    "法師便鞋": {
        "材料": {
            "布料":8,
            
            
        }
    },
    "德魯伊便鞋": {
        "材料": {
            "布料":8,
            "德魯伊綁帶": 1,

        }
    },"邪魔便鞋": {
        "材料": {
            "布料":8,
            "煉獄布質綁帶": 1,

           
        }
    },
     "邪教徒便鞋": {
        "材料": {
            "布料":8,
            "迷惑綁帶": 1,

            
        }
    },
    "精靈鱗片便鞋": {
        "材料": {
            "布料":8,
            "精靈龍鱗": 1,
            
        }
    },
    "純潔便鞋": {
        "材料": {
            "布料":8,
            "聖潔綁帶": 1,
            
        }
    },
#布質長袍鬥士
    "學者長袍": {
        "材料": {
            "布料":16,
            
           
        }
    },
    "牧師長袍": {
        "材料": {
            "布料":16,
            
           
        }
    },
    "法師長袍": {
        "材料": {
            "布料":16,
            
            
        }
    },
    "德魯伊長袍": {
        "材料": {
            "布料":16,
            "德魯伊羽毛": 1,

        }
    },"邪魔長袍": {
        "材料": {
            "布料":16,
            "煉獄布質襯裡": 1,

           
        }
    },
     "邪教徒長袍": {
        "材料": {
            "布料":16,
            "迷惑護身符": 1,

            
        }
    },
    "精靈鱗片長袍": {
        "材料": {
            "布料":16,
            "精靈背翅": 1,
            
        }
    },
    "純潔長袍": {
        "材料": {
            "布料":16,
            "聖潔腰帶": 1,
            
        }
    },
#布質風帽鬥士
    "學者風帽": {
        "材料": {
            "布料":8,
            
           
        }
    },
    "牧師風帽": {
        "材料": {
            "布料":8,
            
           
        }
    },
    "法師風帽": {
        "材料": {
            "布料":8,
            
            
        }
    },
    "德魯伊風帽": {
        "材料": {
            "布料":8,
            "德魯伊防腐鳥喙": 1,

        }
    },"邪魔風帽": {
        "材料": {
            "布料":8,
            "煉獄布質面甲": 1,

           
        }
    },
     "邪教徒風帽": {
        "材料": {
            "布料":8,
            "迷惑襯墊": 1,

            
        }
    },
    "精靈鱗片帽子": {
        "材料": {
            "布料":8,
            "完整精靈腓骨": 1,
            
        }
    },
    "純潔風帽": {
        "材料": {
            "布料":8,
            "聖潔面具": 1,
            
        }
    },

}

tiers = ["T4", "T5", "T6", "T7", "T8"]

new_recipes = {}

for tier in tiers:
    for weapon_name, data in base_recipes.items():
        full_name = f"{tier}_{weapon_name}"
        material_dict = {
            f"{tier}_{mat_name}": qty for mat_name, qty in data["材料"].items()
        }
        new_recipes[full_name] = material_dict

